
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-04',
        gainers: {'COP': 3.7650774777418508, 'PHP': 1.8391081299573409, 'SAR': 1.7526600953201368, 'HKD': 1.6853471289062654, 'VND': 1.6605321009911145},
        losers: {'KRW': -2.303118136545337, 'CLP': -2.5594409772814632, 'NZD': -2.645676456756943, 'JPY': -2.7792225002576534, 'RUB': -4.12721007112936}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-04',
        gainers: {'ILS': 9.708092528460933, 'SAR': 5.078122102673658, 'QAR': 5.044523982096966, 'USD': 5.044523982096655, 'AED': 5.024502971181626},
        losers: {'CLP': -4.476502519188664, 'NZD': -4.941662330860585, 'HUF': -5.187257377696937, 'BRL': -6.9136013005025445, 'RUB': -9.726771386452219}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-04',
        gainers: {'THB': 10.45260160379738, 'MYR': 8.726286282819073, 'ILS': 6.59481963509071, 'JPY': 6.476891444794082, 'PEN': 4.875951923797956},
        losers: {'HUF': -6.309666696554722, 'BRL': -7.77975083482199, 'ARS': -8.026870376665324, 'MXN': -8.997427412410726, 'RUB': -16.95678884521767}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-04',
        gainers: {'MYR': 11.228751973014353, 'PKR': 9.181585593870283, 'HKD': 8.421574439470414, 'ILS': 8.216461222768283, 'THB': 8.183175227115278},
        losers: {'MXN': -11.022825329944247, 'RUB': -11.245133802889267, 'BRL': -14.471834333274677, 'ARS': -15.091606247594038, 'EGP': -34.58358721531268}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-04',
        gainers: {'COP': 28.11060295673341, 'PLN': 20.200669316425074, 'GBP': 16.46442979452732, 'ISK': 15.769515891517589, 'CHF': 15.718050006134934},
        losers: {'PKR': -7.807065798896158, 'RUB': -26.13840576559329, 'TRY': -39.9880150894429, 'EGP': -41.130507078879376, 'ARS': -80.41670901490608}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-04',
        gainers: {'PEN': 30.197394398899135, 'CHF': 25.031167811713217, 'HKD': 24.27434903093988, 'SAR': 24.135513979609854, 'QAR': 24.03633252069331},
        losers: {'UAH': -19.538737399305194, 'PKR': -21.43845725382372, 'TRY': -52.93012059693134, 'EGP': -61.6281690527116, 'ARS': -87.60734011727097}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-04',
        gainers: {'CHF': 41.49646292840764, 'HKD': 32.36155794907474, 'QAR': 32.27749715361036, 'USD': 32.277497153609964, 'AED': 32.27209469096061},
        losers: {'RUB': -25.82454656159387, 'PKR': -26.483460356876286, 'EGP': -58.32281419731574, 'TRY': -77.64963458846266, 'ARS': -92.34641376062257}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-04',
        gainers: {'CHF': 76.30498720704993, 'ILS': 72.292854473927, 'SAR': 59.28485499957564, 'USD': 59.21271319765775, 'QAR': 59.21271319765713},
        losers: {'PKR': -42.31506331602765, 'KZT': -44.45856396513163, 'EGP': -77.63147652471696, 'TRY': -89.50439419199661, 'ARS': -98.67432274880218}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
