
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-07',
        gainers: {'COP': 2.8983655530837735, 'BRL': 1.8666286150727633, 'SAR': 1.7232374560133847, 'USD': 1.568861020671853, 'AED': 1.5633300020194747},
        losers: {'CHF': -1.6833143316622519, 'QAR': -2.1060343080158552, 'KZT': -2.381402225428796, 'JPY': -3.487715578404529, 'RUB': -5.501395895455364}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-07',
        gainers: {'ILS': 9.001328647270316, 'SAR': 4.29397293655959, 'AED': 4.263450120324606, 'USD': 4.260611320223157, 'HKD': 4.144536937829238},
        losers: {'CLP': -3.948231086739487, 'KZT': -4.334703091959099, 'HUF': -4.396642717892005, 'BRL': -5.606334339010203, 'RUB': -6.2543071293308365}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-07',
        gainers: {'THB': 10.009354476927392, 'MYR': 8.77438138243917, 'JPY': 5.51169196320893, 'ILS': 5.441808421924578, 'IDR': 4.549990075794997},
        losers: {'KZT': -6.080596187092428, 'BRL': -6.883821550197731, 'MXN': -7.853038457014399, 'ARS': -8.550955397649373, 'RUB': -14.997779975501995}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-07',
        gainers: {'MYR': 11.363939288323452, 'ILS': 8.993049836424111, 'PKR': 8.397484832567779, 'THB': 8.33107802863573, 'ZAR': 8.091629961235872},
        losers: {'TRY': -9.563159809578249, 'MXN': -10.790712609742142, 'BRL': -13.7336304022896, 'ARS': -15.940230855557221, 'EGP': -34.697918895576905}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-07',
        gainers: {'COP': 27.028155337357457, 'PLN': 21.600985588562818, 'GBP': 17.041507644991306, 'ISK': 16.361550478043117, 'CHF': 15.399979461946305},
        losers: {'PKR': -7.961190212321051, 'RUB': -23.484363863065695, 'EGP': -39.39841443424999, 'TRY': -40.077509387606604, 'ARS': -80.45879897142241}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-07',
        gainers: {'PEN': 28.596620485546538, 'CHF': 25.366965312487764, 'MXN': 24.385399103361134, 'HKD': 24.165563754211107, 'USD': 23.418629489726527},
        losers: {'UAH': -19.507485833723727, 'PKR': -21.667236762629358, 'TRY': -51.5705148433383, 'EGP': -61.779250511778535, 'ARS': -87.68989200854735}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-07',
        gainers: {'CHF': 40.562485477475434, 'HKD': 31.431657460545093, 'USD': 31.416119024143406, 'AED': 31.416119024143402, 'QAR': 31.416119024142997},
        losers: {'UAH': -26.031617369853933, 'PKR': -26.97020853661094, 'EGP': -58.31563813562259, 'TRY': -77.79869091740727, 'ARS': -92.41363313595146}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-07',
        gainers: {'CHF': 76.72283944848142, 'ILS': 72.88575308364112, 'AED': 57.995113305207646, 'SAR': 57.994846624711435, 'USD': 57.98220872203535},
        losers: {'PKR': -42.832502672916085, 'KZT': -45.28418146763221, 'EGP': -77.67642702840814, 'TRY': -89.62944661166078, 'ARS': -98.69205995159673}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
