
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-11-25',
        gainers: {'PLN': 1.7644447224731168, 'PEN': 2.2096855072484116, 'THB': 2.3711450857681173, 'MXN': 3.0315438855436647, 'RUB': 5.376721949090858},
        losers: {'BRL': -5.521999750480643, 'KRW': -3.341315304029861, 'AUD': -2.855742657825875, 'KZT': -2.3029315866157054, 'ZAR': -2.2685644946768533}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-09-25',
        gainers: {'USD': 4.9861188852233385, 'QAR': 4.986118885223522, 'HKD': 5.319306772241257, 'PEN': 6.141484698594047, 'ILS': 7.854114272774526},
        losers: {'BRL': -7.086962566394965, 'HUF': -5.69615691415682, 'NZD': -5.046842593440796, 'AUD': -4.051706876566471, 'KRW': -3.750945402527007}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-06-25',
        gainers: {'JPY': 4.566922174004531, 'PEN': 5.3669177274188, 'ILS': 5.743399295392691, 'MYR': 7.928987207321353, 'THB': 10.70981841826336},
        losers: {'BRL': -9.404125203439238, 'RUB': -8.968723287171906, 'ARS': -8.760994742299193, 'MXN': -7.494412677708781, 'KZT': -6.968012316394047}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2023-12-25',
        gainers: {'QAR': 7.655857556807168, 'HKD': 8.364155238221967, 'THB': 8.822602351652138, 'PKR': 9.420073435693705, 'MYR': 11.137146438550154},
        losers: {'EGP': -34.47516173456406, 'BRL': -15.631377744184594, 'ARS': -15.605406047934986, 'TRY': -10.535888193541792, 'MXN': -9.292712900267388}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2022-12-25',
        gainers: {'ISK': 15.843675832907826, 'CHF': 16.82742103408921, 'GBP': 17.303706300219073, 'PLN': 20.172803832916124, 'COP': 21.87939451417995},
        losers: {'ARS': -80.81071658442035, 'EGP': -45.191546083187205, 'TRY': -40.30394306251418, 'RUB': -21.331024084659205, 'PKR': -8.74412672654828}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2021-12-25',
        gainers: {'SGD': 23.897456848167504, 'HKD': 24.265301862889334, 'CHF': 26.236166238274254, 'MXN': 26.518614883430747, 'PEN': 32.83672366028988},
        losers: {'ARS': -87.67109397311235, 'TRY': -62.20077429142735, 'EGP': -61.90687257638381, 'PKR': -20.963662910272898, 'UAH': -19.758929331886403}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2019-12-25',
        gainers: {'SAR': 31.05636882370504, 'QAR': 31.05636882370535, 'USD': 31.056368823705377, 'HKD': 31.48883471937718, 'CHF': 42.64328881963047},
        losers: {'ARS': -92.3646086672442, 'TRY': -77.88828283708311, 'EGP': -58.68567173561463, 'UAH': -27.553989351626583, 'PKR': -27.13857450935382}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2014-12-25',
        gainers: {'USD': 59.95632985572451, 'SAR': 59.97338140595813, 'HKD': 60.057084617494795, 'ILS': 72.28375357592067, 'CHF': 74.8331732840495},
        losers: {'ARS': -98.66819002745967, 'TRY': -89.46408223591482, 'EGP': -77.50859865352153, 'KZT': -43.24761341707373, 'PKR': -42.28557637635756}
    },

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td>${ticker}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td>${ticker}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
