
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-08',
        gainers: {'COP': 3.023727411181478, 'VND': 2.886944285197434, 'SAR': 2.099599775598413, 'USD': 1.99897420445971, 'QAR': 1.9989742044595062},
        losers: {'CHF': -1.77735878517376, 'NZD': -2.2520166883536743, 'ZAR': -2.7354850947592215, 'RUB': -3.1260080674034025, 'JPY': -3.502498679924431}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-08',
        gainers: {'ILS': 7.237538874002699, 'SAR': 4.620532801045937, 'USD': 4.598221488637243, 'AED': 4.5982214886369634, 'QAR': 4.598221488636937},
        losers: {'AUD': -3.8483479387454866, 'KRW': -3.977306319773397, 'NZD': -4.450758188348705, 'BRL': -5.62731865004592, 'HUF': -5.763118687566621}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-08',
        gainers: {'THB': 9.297811647398847, 'MYR': 8.803403231744673, 'JPY': 5.563095742024606, 'VND': 5.112852609576977, 'IDR': 4.60203903901376},
        losers: {'HUF': -6.192363838803362, 'BRL': -7.220017420549095, 'ARS': -7.847207560254104, 'MXN': -8.447344435922178, 'RUB': -13.346922404359901}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-08',
        gainers: {'MYR': 11.56527169553426, 'THB': 8.949065999454483, 'PKR': 8.92076929796154, 'ILS': 8.839730274087183, 'HKD': 8.410022150209196},
        losers: {'TRY': -8.740813424162935, 'MXN': -10.980191319602232, 'BRL': -14.267363913018436, 'ARS': -15.106092030393569, 'EGP': -34.08904170988868}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-08',
        gainers: {'COP': 26.538182837385836, 'PLN': 20.46008209946417, 'ISK': 16.815882368985164, 'GBP': 15.743966011588675, 'CHF': 15.421055363578922},
        losers: {'PKR': -7.456087645076821, 'RUB': -21.4645024266777, 'EGP': -38.99349743402887, 'TRY': -39.80298821878203, 'ARS': -80.36104564098821}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-08',
        gainers: {'PEN': 29.178456282321896, 'CHF': 25.27491182225733, 'HKD': 24.640232606074296, 'SAR': 24.33341620301574, 'QAR': 24.257215271107103},
        losers: {'UAH': -19.16606686450828, 'PKR': -21.134993439731268, 'TRY': -51.28541978441986, 'EGP': -61.47387092801242, 'ARS': -87.6751410124586}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-08',
        gainers: {'CHF': 41.22353300942334, 'SAR': 32.27463633492366, 'AED': 32.27125917263945, 'QAR': 32.2640566210226, 'USD': 32.26405662102256},
        losers: {'UAH': -24.91561473271153, 'PKR': -26.49899765065659, 'EGP': -58.18006282540685, 'TRY': -77.90888318571578, 'ARS': -92.36001680008414}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-08',
        gainers: {'CHF': 77.8223025058854, 'ILS': 71.64707511284101, 'SAR': 59.27659556924113, 'QAR': 59.12001737004068, 'AED': 59.11556846534797},
        losers: {'PKR': -42.5111962964177, 'KZT': -44.60377657307131, 'EGP': -77.49081193569202, 'TRY': -89.66712706726385, 'ARS': -98.68100299622208}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
