
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-01',
        gainers: {'PHP': 2.5851597527684893, 'COP': 2.2424121355706745, 'HKD': 1.915562793048825, 'ISK': 1.59095759353012, 'AED': 1.5669389219029501},
        losers: {'ZAR': -2.7433037283380264, 'JPY': -3.0249194752640673, 'AUD': -3.272318784948319, 'NZD': -3.562278493337575, 'KRW': -3.834229118137395}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-01',
        gainers: {'ILS': 8.804711125806902, 'HKD': 5.5222042688852735, 'AED': 5.369333667008978, 'USD': 5.363595846617457, 'QAR': 5.349122825209945},
        losers: {'AUD': -5.111587019730528, 'KRW': -5.337366413085795, 'NZD': -5.8740602602739775, 'BRL': -7.570024076921768, 'RUB': -8.449572816815595}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-01',
        gainers: {'THB': 10.425535316909706, 'MYR': 8.655607229098415, 'ILS': 6.704588979441689, 'JPY': 6.098527371998178, 'PEN': 5.276568637960696},
        losers: {'BRL': -5.667690195955791, 'KZT': -6.867758285033704, 'ARS': -8.531723518978188, 'MXN': -8.704762561757583, 'RUB': -18.967321172065198}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-01',
        gainers: {'MYR': 11.303714451967759, 'PKR': 9.793571079935962, 'HKD': 9.043038276735075, 'THB': 8.651353299901508, 'USD': 8.429874128934918},
        losers: {'MXN': -11.360510069504665, 'RUB': -12.231819922601767, 'ARS': -14.644756831235533, 'BRL': -14.914811255163698, 'EGP': -33.79585345819593}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-01',
        gainers: {'COP': 24.899409651520095, 'PLN': 20.675799193463803, 'GBP': 17.380265777876485, 'ISK': 16.507143191338706, 'CHF': 15.6101408852357},
        losers: {'PKR': -7.847276578563865, 'RUB': -24.247249925515277, 'TRY': -40.2090876182835, 'EGP': -44.77604727478301, 'ARS': -80.54359856795881}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-01',
        gainers: {'PEN': 31.056350354510453, 'CHF': 24.851818017367748, 'HKD': 24.467195357465744, 'SAR': 23.97907116110146, 'QAR': 23.955957370435765},
        losers: {'UAH': -19.461714905606943, 'PKR': -21.508626838517593, 'TRY': -53.17920476756994, 'EGP': -61.71528229446049, 'ARS': -87.64534222219794}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-01',
        gainers: {'CHF': 41.46747075473288, 'HKD': 32.86902594164882, 'AED': 32.41629180217074, 'USD': 32.41268638131379, 'QAR': 32.41268638131363},
        losers: {'RUB': -25.78462797974524, 'PKR': -26.43055364558706, 'EGP': -58.251933186869806, 'TRY': -77.73350422699565, 'ARS': -92.30481359086887}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-01',
        gainers: {'CHF': 75.94752158439223, 'ILS': 71.3225193778666, 'HKD': 60.36863351369276, 'QAR': 60.32753089422614, 'AED': 60.278981646586125},
        losers: {'PKR': -41.89346199914894, 'KZT': -44.30502158395721, 'EGP': -77.48071722092786, 'TRY': -89.43535011277875, 'ARS': -98.68247434466885}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
