
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-01',
        gainers: {'PHP': 2.4771964290838815, 'COP': 2.32901329911485, 'VND': 2.127061162207886, 'HKD': 1.9415544356960197, 'THB': 1.6651009106123211},
        losers: {'ZAR': -2.6134104182588533, 'JPY': -3.1079701070721577, 'KRW': -3.2798321611341157, 'AUD': -3.355372804293056, 'NZD': -3.71645610823476}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-01',
        gainers: {'ILS': 8.730217177898748, 'HKD': 5.59657268819771, 'AED': 5.4360224145119, 'USD': 5.433151688569551, 'QAR': 5.418669112787836},
        losers: {'KRW': -5.042791624684161, 'AUD': -5.172776894045552, 'NZD': -5.978642993784781, 'BRL': -7.509006372037748, 'RUB': -8.447949916285474}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-01',
        gainers: {'THB': 10.554346680062208, 'MYR': 8.731028087987063, 'ILS': 6.526304828460017, 'JPY': 6.054545034547731, 'PEN': 5.335067871165751},
        losers: {'BRL': -5.612768208599206, 'KZT': -6.813534999156842, 'ARS': -8.478469023939725, 'MXN': -9.021229115447406, 'RUB': -18.95572621050284}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-01',
        gainers: {'MYR': 11.386796257169506, 'PKR': 9.827422308078514, 'HKD': 9.155008672988323, 'THB': 8.783781827659478, 'USD': 8.498675818210447},
        losers: {'MXN': -11.663152848557608, 'RUB': -12.209468209179992, 'ARS': -14.590596619709215, 'BRL': -14.860822400477511, 'EGP': -34.09757532995107}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-01',
        gainers: {'COP': 24.972503506301603, 'PLN': 20.258516344392337, 'GBP': 17.364135019827497, 'ISK': 16.60967010214777, 'CHF': 15.634253767895737},
        losers: {'PKR': -7.834293969214322, 'RUB': -24.25863459351636, 'TRY': -39.82379183731112, 'EGP': -44.84952191803004, 'ARS': -80.53451171103698}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-01',
        gainers: {'PEN': 31.132103842466435, 'CHF': 24.823167475370028, 'HKD': 24.54287285845301, 'SAR': 24.054025080239814, 'USD': 24.03089731568998},
        losers: {'UAH': -19.60222764926492, 'PKR': -21.48677728372129, 'TRY': -52.87101126321468, 'EGP': -61.757750502782, 'ARS': -87.63787297749889}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-01',
        gainers: {'CHF': 41.454673993954415, 'HKD': 32.97221858540943, 'AED': 32.484610774480984, 'USD': 32.484610774480934, 'QAR': 32.484610774480046},
        losers: {'RUB': -25.783837055828208, 'PKR': -26.414588832768064, 'EGP': -58.29043263863066, 'TRY': -77.58831210923466, 'ARS': -92.30063369219067}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-01',
        gainers: {'CHF': 75.97852792442012, 'ILS': 71.33259152389017, 'QAR': 60.45959394781979, 'AED': 60.4066370509816, 'USD': 60.397902446878945},
        losers: {'PKR': -41.86455770377301, 'KZT': -44.25914519031237, 'EGP': -77.41986606624957, 'TRY': -89.36348033781047, 'ARS': -98.68138908837966}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
