
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-09',
        gainers: {'COP': 2.8792507553200943, 'VND': 2.689132239937365, 'SAR': 1.942216926294112, 'QAR': 1.8973049434910891, 'HKD': 1.8714943215266993},
        losers: {'CHF': -1.80965315380732, 'AUD': -2.0083716965380534, 'JPY': -2.265175519977366, 'NZD': -2.7072726338672624, 'ZAR': -4.138156300691992}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-09',
        gainers: {'ILS': 7.194750652481349, 'SAR': 4.238558632507417, 'QAR': 4.213637652118478, 'USD': 4.210773538512809, 'AED': 4.210773538512484},
        losers: {'NZD': -3.816724773435651, 'AUD': -3.9318131289535874, 'KRW': -4.056791662787437, 'BRL': -4.613133935050964, 'HUF': -5.396023304739697}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-09',
        gainers: {'THB': 9.428935762118023, 'MYR': 8.817992464226428, 'JPY': 6.176865605283532, 'VND': 4.955797129237525, 'HKD': 4.386894586805273},
        losers: {'HUF': -5.715378168476755, 'BRL': -7.901020601539632, 'ARS': -8.030336225219422, 'MXN': -9.091696173125648, 'RUB': -11.689855229020496}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-09',
        gainers: {'MYR': 11.077553250360747, 'ILS': 9.621233014095171, 'THB': 8.512470251313587, 'PKR': 8.471786319071697, 'HKD': 8.121690782988132},
        losers: {'TRY': -8.863281973885842, 'MXN': -10.806677981838112, 'BRL': -13.68106001625658, 'ARS': -15.50437756138937, 'EGP': -34.31285998654492}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-09',
        gainers: {'COP': 27.541662223087833, 'PLN': 20.033815597674817, 'ISK': 16.26208509193426, 'CHF': 15.04249305449084, 'GBP': 14.925469652516188},
        losers: {'PKR': -7.159360848971589, 'RUB': -22.369613500441698, 'EGP': -37.91212939215347, 'TRY': -39.58066929501581, 'ARS': -80.22171374575345}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-09',
        gainers: {'PEN': 28.910812436797105, 'CHF': 25.009732145457754, 'HKD': 24.46311054409055, 'SAR': 24.164659271839007, 'QAR': 24.143028195414875},
        losers: {'UAH': -19.338242014015513, 'PKR': -21.28390617330934, 'TRY': -51.29613825732326, 'EGP': -61.50228452882314, 'ARS': -87.70341631021495}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-09',
        gainers: {'CHF': 40.82070476961179, 'QAR': 32.014713759521555, 'SAR': 31.967348849193545, 'USD': 31.96031209176376, 'AED': 31.942347064386684},
        losers: {'UAH': -24.716778975110813, 'PKR': -27.087498489927224, 'EGP': -58.38194869091695, 'TRY': -78.0725240435104, 'ARS': -92.39721324378372}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-09',
        gainers: {'CHF': 77.26059387704287, 'ILS': 71.41297948606429, 'SAR': 59.20637602544944, 'QAR': 59.12842103576457, 'HKD': 59.10893467495322},
        losers: {'PKR': -42.624152194670316, 'KZT': -44.5339453481118, 'EGP': -77.4867719481794, 'TRY': -89.6743223013757, 'ARS': -98.68282136519413}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
