
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-06',
        gainers: {'COP': 2.7379981626406216, 'SAR': 1.5772510793040677, 'USD': 1.5231371529926265, 'AED': 1.5037873024716757, 'QAR': 1.4952461812472675},
        losers: {'CLP': -1.793986393165936, 'NZD': -1.806809471289973, 'KZT': -2.4253477792418767, 'JPY': -2.7646121536359085, 'RUB': -5.382340151498231}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-06',
        gainers: {'ILS': 9.427777606443021, 'SAR': 4.416757837243094, 'AED': 4.3953528021368875, 'USD': 4.394500068452651, 'HKD': 4.318057919283304},
        losers: {'HUF': -4.116987389557206, 'CLP': -4.200242421764731, 'KZT': -4.90336353959717, 'BRL': -6.826763487598905, 'RUB': -7.948357915116625}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-06',
        gainers: {'THB': 10.03779243905923, 'MYR': 8.156086874307952, 'JPY': 6.220921825297525, 'ILS': 5.127961467868781, 'PHP': 4.693573559515191},
        losers: {'KZT': -6.082320804289593, 'BRL': -7.434375623387644, 'MXN': -7.805717592574885, 'ARS': -8.286799287909366, 'RUB': -15.691862615961675}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-06',
        gainers: {'MYR': 10.83996603961413, 'ILS': 8.618622747794289, 'ZAR': 8.507311611158478, 'PKR': 8.373533120791533, 'THB': 8.330423638653391},
        losers: {'TRY': -9.5259637939232, 'MXN': -10.762887582843437, 'BRL': -14.260966774321778, 'ARS': -15.714408287591084, 'EGP': -34.72517801593937}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-06',
        gainers: {'COP': 25.50567740073969, 'PLN': 21.45334746680251, 'GBP': 18.059849972678226, 'CHF': 16.587474197829074, 'ISK': 15.709183626754204},
        losers: {'PKR': -8.385429233344437, 'RUB': -24.01230961579725, 'EGP': -39.68960239458334, 'TRY': -40.31599310126124, 'ARS': -80.51044327491934}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-06',
        gainers: {'PEN': 29.612597523503343, 'CHF': 25.912345428954126, 'MXN': 24.204135849891824, 'HKD': 23.699078483454812, 'SGD': 23.332848293705847},
        losers: {'UAH': -19.571204158716434, 'PKR': -21.82305612825352, 'TRY': -51.76425999471562, 'EGP': -61.862775065606044, 'ARS': -87.6786519656574}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-06',
        gainers: {'CHF': 41.43296594474034, 'HKD': 31.700273974232235, 'QAR': 31.650130555758594, 'USD': 31.650130555758565, 'AED': 31.632207756379948},
        losers: {'UAH': -25.811063837531833, 'PKR': -26.887504641802224, 'EGP': -58.24966221260769, 'TRY': -77.74880599197986, 'ARS': -92.38069894258265}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-06',
        gainers: {'CHF': 77.2543820990834, 'ILS': 72.00713897183942, 'SAR': 58.05762181741068, 'USD': 58.00287960124888, 'AED': 57.977067057953356},
        losers: {'PKR': -42.825084276732916, 'KZT': -45.27702228125873, 'EGP': -77.67791762203257, 'TRY': -89.60812247290374, 'ARS': -98.69202092953351}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
