
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-11-29',
        gainers: {'RUB': 2.5307372640902748, 'PHP': 2.527139804419534, 'THB': 1.93642557718716, 'COP': 1.9137474535505312, 'MXN': 1.8359651290472951},
        losers: {'ZAR': -1.868540712700097, 'JPY': -3.0256706377453044, 'NZD': -3.0961397240248063, 'AUD': -3.161089173589083, 'KRW': -4.164405407899019}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-09-29',
        gainers: {'ILS': 7.013517944690589, 'HKD': 5.849325425394598, 'USD': 5.679595666521687, 'QAR': 5.679595666521516, 'AED': 5.673841107690003},
        losers: {'AUD': -4.90176185065035, 'RUB': -5.87578952755448, 'KRW': -6.031796771326483, 'NZD': -6.096935270792614, 'BRL': -7.336779553394511}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-06-29',
        gainers: {'THB': 11.318875455782164, 'MYR': 8.780585433956594, 'PEN': 5.497624553887932, 'ILS': 5.165167460324114, 'JPY': 5.098023532881554},
        losers: {'BRL': -6.974329239212457, 'MXN': -7.364144933246765, 'KZT': -7.489738641131863, 'ARS': -8.923096286289239, 'RUB': -16.357546770993363}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2023-12-29',
        gainers: {'MYR': 11.577910791201095, 'THB': 9.307946601217035, 'HKD': 8.859726234845528, 'USD': 8.258437657999291, 'QAR': 8.258437657998902},
        losers: {'RUB': -9.029299661822126, 'MXN': -9.711664037969165, 'ARS': -14.95337027097088, 'BRL': -15.261268748172077, 'EGP': -34.19646562796339}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2022-12-29',
        gainers: {'COP': 24.161457162642872, 'PLN': 20.85540960374672, 'GBP': 17.792907394045155, 'ISK': 15.63172380643842, 'CHF': 15.631467377552339},
        losers: {'PKR': -8.66047626085894, 'RUB': -21.235277331348684, 'TRY': -39.80265278886361, 'EGP': -45.076985699610326, 'ARS': -80.59970474874847}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2021-12-29',
        gainers: {'PEN': 30.86866570203354, 'CHF': 25.466054410323242, 'MXN': 25.07795084233799, 'HKD': 24.25199332931717, 'USD': 23.660343947393766},
        losers: {'UAH': -19.588431538317245, 'PKR': -20.967619110270466, 'TRY': -55.44467395060557, 'EGP': -61.850710893206696, 'ARS': -87.660998946761}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2019-12-29',
        gainers: {'CHF': 42.458880852655646, 'HKD': 32.22040062884664, 'USD': 31.772937319853234, 'QAR': 31.7729373198527, 'AED': 31.72988482052459},
        losers: {'UAH': -25.429429396455884, 'PKR': -26.937545467423522, 'EGP': -58.49357316259491, 'TRY': -77.64638370853608, 'ARS': -92.34057662318575}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2014-12-29',
        gainers: {'CHF': 75.98724484347437, 'ILS': 69.38973436005655, 'HKD': 60.415224909552656, 'SAR': 59.94239076968786, 'USD': 59.87420504982097},
        losers: {'PKR': -42.187834471997505, 'KZT': -44.94013683209954, 'EGP': -77.57199586655467, 'TRY': -89.40420429946599, 'ARS': -98.67115545288343}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
