
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-02',
        gainers: {'COP': 2.5497426105273866, 'PHP': 2.220209282779697, 'THB': 2.0769396415178076, 'ISK': 1.9323374235409247, 'VND': 1.7979375111319074},
        losers: {'ZAR': -2.5863247092924735, 'AUD': -3.1587394300175666, 'KRW': -3.5088821657513134, 'JPY': -3.537212833460575, 'NZD': -3.7081028132261955}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-02',
        gainers: {'ILS': 9.397936852523651, 'HKD': 5.326586529764317, 'AED': 5.278602172719517, 'USD': 5.275735732886996, 'QAR': 5.275735732886817},
        losers: {'KRW': -5.242531923395157, 'AUD': -5.330397512035235, 'NZD': -5.827820364541786, 'BRL': -7.320240474868978, 'RUB': -9.219963974945475}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-02',
        gainers: {'THB': 10.862523366478184, 'MYR': 8.869767042574496, 'ILS': 6.7262420413162065, 'JPY': 5.985893498674706, 'IDR': 5.0978732389647075},
        losers: {'BRL': -5.295542098413996, 'KZT': -6.842929838100457, 'ARS': -8.415651329848334, 'MXN': -9.60590195518757, 'RUB': -17.91208075232017}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-02',
        gainers: {'MYR': 11.052237847817393, 'PKR': 9.132473974291907, 'HKD': 8.595941132485828, 'ILS': 7.911143955598695, 'THB': 7.90241888690883},
        losers: {'RUB': -11.28362805292897, 'MXN': -11.85396812883481, 'BRL': -14.091597770100764, 'ARS': -15.086341263218051, 'EGP': -34.35351951948249}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-02',
        gainers: {'COP': 24.639450096291675, 'PLN': 20.010615811374375, 'GBP': 17.66210609164258, 'ISK': 16.459903044490286, 'CHF': 15.57327078382675},
        losers: {'PKR': -7.926682820037098, 'RUB': -26.825495372171076, 'TRY': -39.56629616285972, 'EGP': -44.94943548420014, 'ARS': -80.39732578668001}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-02',
        gainers: {'PEN': 31.132103842466435, 'CHF': 24.823167475370028, 'HKD': 24.54287285845301, 'SAR': 24.054025080239814, 'USD': 24.03089731568998},
        losers: {'UAH': -19.60222764926492, 'PKR': -21.48677728372129, 'TRY': -52.87101126321468, 'EGP': -61.757750502782, 'ARS': -87.63787297749889}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-02',
        gainers: {'CHF': 41.9079564445619, 'HKD': 32.844086957992616, 'AED': 32.391392213010654, 'USD': 32.3913922130106, 'QAR': 32.39139221301052},
        losers: {'RUB': -26.064302348001945, 'PKR': -26.466364855161107, 'EGP': -58.319780242448594, 'TRY': -77.56867757380934, 'ARS': -92.31372852057615}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-02',
        gainers: {'CHF': 75.87241816489497, 'ILS': 72.0732077044998, 'AED': 59.850773360924606, 'SAR': 59.83771721281451, 'USD': 59.8377172128143},
        losers: {'PKR': -42.124981353867085, 'KZT': -44.31670513431347, 'EGP': -77.4987265589364, 'TRY': -89.40062808828411, 'ARS': -98.68599430048593}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
