
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-05',
        gainers: {'COP': 3.4942032477194274, 'HKD': 2.146725713766228, 'SAR': 2.117962200096046, 'USD': 2.085310573494116, 'QAR': 2.085310573493667},
        losers: {'ZAR': -1.8565119955514453, 'CLP': -2.569224219170166, 'JPY': -2.6238045189785053, 'NZD': -2.6769196607670054, 'RUB': -7.282570027785022}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-05',
        gainers: {'ILS': 9.554284493784213, 'SAR': 4.907319836146303, 'AED': 4.874632977198618, 'QAR': 4.873776328605204, 'USD': 4.873776328605131},
        losers: {'NZD': -4.465234363724318, 'CLP': -4.631773945340612, 'HUF': -4.87915434162498, 'BRL': -7.438260424429028, 'RUB': -9.817996717057497}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-05',
        gainers: {'THB': 10.330386810257357, 'MYR': 8.834888673019888, 'JPY': 6.452362874140347, 'ILS': 5.200511656499204, 'PEN': 4.972409278272029},
        losers: {'HUF': -6.216083125522219, 'BRL': -7.687635672733392, 'ARS': -7.9350020525199865, 'MXN': -8.906528539329486, 'RUB': -17.25924176482405}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-05',
        gainers: {'MYR': 11.25176057096844, 'PKR': 9.014075000357865, 'THB': 8.770104537630798, 'ILS': 8.767975374149124, 'HKD': 8.436295487281143},
        losers: {'MXN': -11.004419656926087, 'RUB': -11.342671602203035, 'BRL': -14.454142116625537, 'ARS': -15.074042235951005, 'EGP': -34.57005528301452}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-05',
        gainers: {'COP': 28.554564610502613, 'PLN': 21.157417510282116, 'GBP': 17.517828152085883, 'ISK': 16.507593113943585, 'CHF': 16.07842075612405},
        losers: {'PKR': -8.128035126470833, 'RUB': -26.107484304836404, 'EGP': -39.7220193205073, 'TRY': -40.21489366368903, 'ARS': -80.46703489818144}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-05',
        gainers: {'PEN': 30.37702677057724, 'CHF': 25.163413607524905, 'HKD': 24.3127213568712, 'SAR': 24.110253179900553, 'QAR': 23.981479339008335},
        losers: {'UAH': -19.517546495083607, 'PKR': -21.35509821787976, 'TRY': -52.10536847781921, 'EGP': -61.7194796184654, 'ARS': -87.61480671336223}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-05',
        gainers: {'CHF': 41.61315887200641, 'HKD': 32.31828496172116, 'USD': 32.26365110539536, 'QAR': 32.2636511053948, 'AED': 32.258249208244145},
        losers: {'RUB': -25.838558085963996, 'PKR': -26.491155645753402, 'EGP': -58.32717672561058, 'TRY': -77.65197409626843, 'ARS': -92.34721489404563}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-05',
        gainers: {'CHF': 76.32004134868123, 'ILS': 72.37061648437246, 'SAR': 59.252787379959216, 'USD': 59.180660101807305, 'QAR': 59.18066010180668},
        losers: {'PKR': -42.32667658966334, 'KZT': -44.46974570393315, 'EGP': -77.63597981099714, 'TRY': -89.50650719322759, 'ARS': -98.68143810767414}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
