
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-03',
        gainers: {'PHP': 2.5744434451512, 'COP': 2.0968534156424403, 'ISK': 1.8556769328272982, 'THB': 1.8141236521935291, 'HKD': 1.655677898454713},
        losers: {'KRW': -2.372658592104465, 'AUD': -2.822017016752181, 'NZD': -3.1902501791568962, 'RUB': -3.3021279459514776, 'JPY': -3.3328187317743807}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-03',
        gainers: {'ILS': 9.609947066678327, 'SAR': 5.2014751976387394, 'USD': 5.12861322760302, 'AED': 5.108576189658192, 'QAR': 5.0852909968769815},
        losers: {'KRW': -4.405020864943235, 'AUD': -4.631344427594414, 'NZD': -4.94000223353162, 'BRL': -7.4858067462120825, 'RUB': -10.522989389899728}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-03',
        gainers: {'THB': 10.980047748847435, 'MYR': 9.261975510359049, 'ILS': 6.645978157265646, 'JPY': 6.539119612345459, 'PHP': 4.990385640935325},
        losers: {'KZT': -6.3830833789777, 'BRL': -7.473058452812848, 'ARS': -8.187359985592323, 'MXN': -9.238116374733153, 'RUB': -17.584751203499994}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-03',
        gainers: {'MYR': 11.578128136683347, 'PKR': 9.108250257512102, 'THB': 8.784854092827967, 'HKD': 8.384192277900796, 'ZAR': 8.155045934624763},
        losers: {'RUB': -11.008549895569132, 'MXN': -11.5540020596922, 'BRL': -14.705316594287746, 'ARS': -15.203758623467092, 'EGP': -34.26350911822269}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-03',
        gainers: {'COP': 25.135975659888143, 'PLN': 20.679189847988745, 'ISK': 17.43129586835354, 'GBP': 17.12989503765956, 'CHF': 16.35079772844675},
        losers: {'PKR': -8.124727574722643, 'RUB': -26.31470138203041, 'TRY': -40.19819611455693, 'EGP': -44.910654335329056, 'ARS': -80.48524885410652}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-03',
        gainers: {'PEN': 30.30568991369505, 'CHF': 25.386501252735, 'HKD': 24.3693556207572, 'SAR': 24.034980129281756, 'QAR': 23.949074176075673},
        losers: {'UAH': -19.596297419501624, 'PKR': -21.53857242930953, 'TRY': -53.898204167025455, 'EGP': -61.54084079562345, 'ARS': -87.62877688924674}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-03',
        gainers: {'CHF': 41.52228822933624, 'HKD': 32.31929984820876, 'SAR': 32.308225845312535, 'QAR': 32.30117241606446, 'USD': 32.30117241606406},
        losers: {'RUB': -26.296052138957265, 'PKR': -26.516475285458764, 'EGP': -58.290698995803126, 'TRY': -77.62942936374817, 'ARS': -92.3301361326312}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-03',
        gainers: {'CHF': 76.65973447960836, 'ILS': 72.35641915089312, 'SAR': 59.63985115332541, 'HKD': 59.596068628720374, 'USD': 59.5292854599326},
        losers: {'PKR': -42.23666021014946, 'KZT': -44.42415471843657, 'EGP': -77.51115159624385, 'TRY': -89.40859294601526, 'ARS': -98.67104295004495}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
