
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-02',
        gainers: {'PHP': 2.804560041086948, 'COP': 2.528068488948699, 'THB': 2.3924034182196703, 'ISK': 2.098088103501354, 'HKD': 1.6353518399802685},
        losers: {'AUD': -2.6641482553143723, 'RUB': -2.8777444279922184, 'KRW': -3.120812855967201, 'NZD': -3.2640859684334784, 'JPY': -3.4053976187801807}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-02',
        gainers: {'ILS': 9.32666121734757, 'QAR': 5.401192519712799, 'USD': 5.4011925197124, 'AED': 5.381103529387959, 'HKD': 5.31317791737019},
        losers: {'KRW': -4.902695013996, 'AUD': -4.903708012926768, 'NZD': -5.459273665223667, 'BRL': -7.855679308212729, 'RUB': -10.113624606306718}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-02',
        gainers: {'THB': 11.210277151092336, 'MYR': 8.930005418402851, 'ILS': 6.554063018040926, 'JPY': 6.163307220953237, 'PHP': 4.9595530805362955},
        losers: {'BRL': -5.739977849487527, 'KZT': -6.687136868963342, 'ARS': -8.395892570867202, 'MXN': -9.107064433757458, 'RUB': -18.437899910195743}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-02',
        gainers: {'MYR': 11.102289374346288, 'PKR': 9.30377373588049, 'HKD': 8.662525877826388, 'THB': 8.22978758272657, 'ILS': 8.118143732110259},
        losers: {'MXN': -11.376625536423862, 'RUB': -11.709051254337625, 'BRL': -14.513357560271064, 'ARS': -15.076731222424378, 'EGP': -34.159734899678945}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-02',
        gainers: {'COP': 24.628612698292493, 'PLN': 19.86079545327656, 'GBP': 16.906628419701036, 'ISK': 16.663791291322635, 'CHF': 15.566692963485762},
        losers: {'PKR': -7.7654885657994726, 'RUB': -27.28142996119051, 'TRY': -39.84464413093096, 'EGP': -44.77694782617394, 'ARS': -80.39156304219027}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-02',
        gainers: {'PEN': 29.282945503982276, 'CHF': 24.823197407625823, 'HKD': 24.630625435704346, 'SAR': 24.337661182004126, 'USD': 24.228381004653066},
        losers: {'UAH': -19.474217217898033, 'PKR': -21.36176745802518, 'TRY': -53.15725337335291, 'EGP': -61.64399750526704, 'ARS': -87.63619537070983}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-02',
        gainers: {'CHF': 41.82093042528072, 'HKD': 32.850711379751566, 'QAR': 32.53702365785159, 'USD': 32.537023657851385, 'AED': 32.518980117178636},
        losers: {'PKR': -26.385477349172128, 'RUB': -26.58053966094632, 'EGP': -58.21634447379657, 'TRY': -77.66708723394638, 'ARS': -92.31646318563895}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-02',
        gainers: {'CHF': 75.58789493409101, 'ILS': 72.48507586224436, 'SAR': 60.30888908170235, 'USD': 60.19786001627576, 'QAR': 60.17585481572373},
        losers: {'PKR': -41.99457864398713, 'KZT': -44.19124076790126, 'EGP': -77.41690261994543, 'TRY': -89.36420520083257, 'ARS': -98.68494873515482}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
