
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-12-03',
        gainers: {'COP': 3.412215618261537, 'PHP': 2.2749718880987135, 'SAR': 1.685643397763021, 'HKD': 1.6100078171990297, 'USD': 1.5584179155406004},
        losers: {'KRW': -2.2794109916009733, 'AUD': -2.628506115955835, 'RUB': -2.7468108600240617, 'NZD': -3.188151060606463, 'JPY': -3.3361453673938413}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-10-03',
        gainers: {'ILS': 9.580606261751399, 'SAR': 5.259413206148216, 'USD': 5.197726815883699, 'AED': 5.177676605201732, 'QAR': 5.1543761042836564},
        losers: {'KRW': -4.564974897885562, 'NZD': -4.946496495186032, 'HUF': -5.023050345717142, 'BRL': -6.426047656132246, 'RUB': -10.024646458420731}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-07-03',
        gainers: {'THB': 10.247355173613848, 'MYR': 8.766776825354357, 'ILS': 6.588669306447367, 'JPY': 6.495159468380677, 'PEN': 4.951904990566332},
        losers: {'BRL': -6.224397026971823, 'KZT': -6.359684224229389, 'ARS': -8.208905788727717, 'MXN': -8.415434782742624, 'RUB': -17.150126059762357}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2024-01-03',
        gainers: {'MYR': 11.036860175862785, 'PKR': 9.086509221065524, 'HKD': 8.24926464105935, 'ILS': 8.030247045493006, 'USD': 7.8938548424498265},
        losers: {'RUB': -10.548860530103847, 'MXN': -10.780894459929973, 'BRL': -13.658228413983553, 'ARS': -15.250808287605839, 'EGP': -34.306992815139395}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2023-01-03',
        gainers: {'COP': 26.761443188226615, 'PLN': 20.592502858860993, 'GBP': 17.09710936889844, 'ISK': 16.47806231375987, 'CHF': 16.2471808899105},
        losers: {'PKR': -8.062924987829607, 'RUB': -25.887856887225556, 'TRY': -40.23635969732863, 'EGP': -44.899082688353005, 'ARS': -80.47906707416568}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2022-01-03',
        gainers: {'PEN': 31.45876920821056, 'CHF': 25.299823420499468, 'HKD': 24.34823963068988, 'SAR': 24.134335419044817, 'USD': 24.061587540003273},
        losers: {'UAH': -19.39580696370519, 'PKR': -21.477470989536666, 'TRY': -54.181198136907206, 'EGP': -61.528685046092754, 'ARS': -87.62354630247371}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2020-01-03',
        gainers: {'CHF': 41.531848136093366, 'USD': 32.42095224974045, 'QAR': 32.42095224974, 'SAR': 32.41389318730341, 'AED': 32.40292451098535},
        losers: {'RUB': -25.853922466154657, 'PKR': -26.459425328205604, 'EGP': -58.277615241904556, 'TRY': -77.70044433692308, 'ARS': -92.32691154894674}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2015-01-03',
        gainers: {'CHF': 76.0777363516326, 'ILS': 72.13387529448673, 'SAR': 59.19830397731365, 'USD': 59.12620137527272, 'QAR': 59.1262013752724},
        losers: {'PKR': -42.39003690147289, 'KZT': -44.48874365840308, 'EGP': -77.64363096697878, 'TRY': -89.46147625417153, 'ARS': -98.67504308546748}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
