
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-11-28',
        gainers: {'PHP': 2.594313415259182, 'RUB': 2.2826727280430483, 'THB': 2.2558282874448348, 'MXN': 1.798490921521536, 'HKD': 1.5675624819148901},
        losers: {'ZAR': -2.0347406765576177, 'JPY': -3.0298165134606614, 'AUD': -3.2715993248383195, 'NZD': -3.3774906064157015, 'KRW': -4.170796700284084}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-09-28',
        gainers: {'ILS': 6.5333849266134685, 'HKD': 5.8819303920257155, 'USD': 5.736506133357924, 'QAR': 5.7365061333578, 'AED': 5.730748475586623},
        losers: {'AUD': -5.007236241145193, 'KRW': -6.054441320664394, 'NZD': -6.3292691066920534, 'RUB': -6.5370391709381455, 'BRL': -7.286878651513988}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-06-28',
        gainers: {'THB': 11.238096067834238, 'MYR': 8.747756839916915, 'PEN': 5.4210694008959734, 'ILS': 5.19852847266001, 'JPY': 4.844935134438555},
        losers: {'MXN': -6.597832050258061, 'KZT': -6.7471846962077295, 'BRL': -8.561241805084789, 'ARS': -8.76159960392567, 'RUB': -16.96401541122296}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2023-12-28',
        gainers: {'MYR': 11.595336163118459, 'PKR': 9.672571389556728, 'HKD': 9.04164745389506, 'THB': 8.943318250521564, 'QAR': 8.275344620372364},
        losers: {'MXN': -9.697563506575616, 'RUB': -9.704554081681477, 'ARS': -14.94008834856453, 'BRL': -15.248034910959257, 'EGP': -34.165522456326386}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2022-12-28',
        gainers: {'COP': 21.970120176513873, 'PLN': 21.54151362670053, 'GBP': 17.714027586679528, 'ISK': 15.9998235078293, 'CHF': 15.923670773500326},
        losers: {'PKR': -8.50246270645286, 'RUB': -23.431205746602416, 'TRY': -39.95661108951003, 'EGP': -45.10400379371948, 'ARS': -80.71134043320612}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2021-12-28',
        gainers: {'PEN': 31.19240689503513, 'CHF': 25.97731759837813, 'MXN': 25.86735910690058, 'HKD': 24.492693480083027, 'SAR': 23.948562105651057},
        losers: {'UAH': -19.459415754947944, 'PKR': -20.869894568317925, 'TRY': -58.324917430429615, 'EGP': -61.74994137780728, 'ARS': -87.64749482646296}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2019-12-28',
        gainers: {'CHF': 42.38906412956315, 'HKD': 32.28695530782116, 'SAR': 31.821880671559626, 'USD': 31.790263655089284, 'QAR': 31.790263655089163},
        losers: {'UAH': -25.41962438845281, 'PKR': -26.71475993011417, 'EGP': -58.50759113574541, 'TRY': -77.64243521438772, 'ARS': -92.33956951398838}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2014-12-28',
        gainers: {'SEK': 92.82755064046205, 'ILS': 69.70185028031169, 'CHF': 60.942980268515804, 'SAR': 60.00885509500679, 'USD': 59.97047753142519},
        losers: {'PKR': -41.951762376716886, 'KZT': -44.22160538993774, 'EGP': -77.49333108324109, 'TRY': -89.41728008922938, 'ARS': -98.66783554398747}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
