
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-11-27',
        gainers: {'RUB': 9.596217639077924, 'MXN': 2.8405044534182746, 'THB': 2.4780040740287723, 'PHP': 2.2557606265783634, 'PEN': 1.6171165387347315},
        losers: {'BRL': -2.898295148953293, 'JPY': -2.9358866979484244, 'AUD': -3.083477621520327, 'NZD': -3.1931664335945222, 'KRW': -4.503544543422267}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-09-27',
        gainers: {'ILS': 6.690425212242261, 'HKD': 6.040241179502936, 'USD': 5.755893049127196, 'AED': 5.755893049126804, 'SAR': 5.688236340259048},
        losers: {'HUF': -4.704335946270153, 'AUD': -4.7229024915677185, 'KRW': -5.660651101245677, 'NZD': -5.944721968042254, 'BRL': -7.136709401568897}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-06-27',
        gainers: {'THB': 11.357752320290349, 'MYR': 8.734437596189878, 'PEN': 5.095522329781346, 'ILS': 5.084410073030967, 'JPY': 4.702401518211688},
        losers: {'MXN': -6.479176792550343, 'KZT': -8.127721538223492, 'BRL': -8.570664906788252, 'ARS': -8.843144284134546, 'RUB': -15.702962886666558}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2023-12-27',
        gainers: {'MYR': 12.258898070177707, 'PKR': 9.827408055826814, 'THB': 9.328154302670793, 'HKD': 8.913786153192929, 'USD': 8.340633095391818},
        losers: {'TRY': -9.63677001222642, 'MXN': -9.648251698642255, 'ARS': -14.94788385593424, 'BRL': -15.551525578346276, 'EGP': -34.445602761053124}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2022-12-27',
        gainers: {'COP': 22.059041192104097, 'PLN': 21.051966589561243, 'GBP': 17.845340906344664, 'CHF': 16.2960227727146, 'ISK': 15.57887810637712},
        losers: {'PKR': -8.426495854038652, 'RUB': -24.000296649069043, 'TRY': -40.2182842422863, 'EGP': -45.29447199191883, 'ARS': -80.69243619009964}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2021-12-27',
        gainers: {'PEN': 31.937117297747125, 'MXN': 26.311581164788418, 'CHF': 26.08513245282197, 'HKD': 24.405309583172624, 'SAR': 23.968942310183394},
        losers: {'UAH': -19.378416072539327, 'PKR': -20.8356706788269, 'TRY': -58.92337909846066, 'EGP': -61.78628124661342, 'ARS': -87.65077276111542}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2019-12-27',
        gainers: {'CHF': 42.95565701186161, 'HKD': 32.27082672879785, 'SAR': 31.54905076446346, 'USD': 31.51749918529076, 'QAR': 31.517499185290543},
        losers: {'UAH': -25.605272985295112, 'PKR': -26.89552674775195, 'EGP': -58.593467395422195, 'TRY': -77.7831565423785, 'ARS': -92.3644290248644}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2014-12-27',
        gainers: {'CHF': 75.6445567305281, 'ILS': 69.99440670819105, 'HKD': 60.34172632330353, 'QAR': 60.12336136038243, 'SAR': 60.108992417099174},
        losers: {'PKR': -41.93853795456967, 'KZT': -44.186697952699305, 'EGP': -77.47924587806168, 'TRY': -89.43562098837073, 'ARS': -98.66700184399548}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
