
// Данные по валютам
const data = {

    '1m': {
        title: 'Лидеры абсолютного роста/падения валют Forex за месяц с 2024-11-30',
        gainers: {'PHP': 2.5851597527684893, 'COP': 2.2424121355706745, 'HKD': 1.915562793048825, 'ISK': 1.59095759353012, 'AED': 1.5669389219029501},
        losers: {'ZAR': -2.7433037283380264, 'JPY': -3.0249194752640673, 'AUD': -3.272318784948319, 'NZD': -3.562278493337575, 'KRW': -3.834229118137395}
    },

    '1q': {
        title: 'Лидеры абсолютного роста/падения валют Forex за квартал с 2024-09-30',
        gainers: {'ILS': 8.052709503575898, 'HKD': 5.913903416916113, 'AED': 5.795782785785788, 'USD': 5.790021743377525, 'QAR': 5.749333273476},
        losers: {'AUD': -5.192315310627557, 'KRW': -5.495089986839352, 'NZD': -6.46421726180585, 'BRL': -6.77168798595031, 'RUB': -10.904406262497817}
    },

    'y2': {
        title: 'Лидеры абсолютного роста/падения валют Forex за полгода с 2024-06-30',
        gainers: {'THB': 10.811484372288795, 'MYR': 8.943268661745511, 'ILS': 6.6524052638085305, 'JPY': 5.893249169677824, 'PEN': 5.098001130572932},
        losers: {'BRL': -6.542282207520854, 'KZT': -6.789142936372968, 'ARS': -8.858568780382289, 'MXN': -9.063473410494302, 'RUB': -19.57576687158691}
    },

    '1y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за год с 2023-12-31',
        gainers: {'MYR': 11.23863808926434, 'PKR': 9.785021699453319, 'HKD': 9.033979815957762, 'THB': 8.794105358922321, 'USD': 8.477567374171251},
        losers: {'MXN': -11.316659734949862, 'RUB': -12.206285273208966, 'ARS': -14.613789097702648, 'BRL': -14.87738624839884, 'EGP': -34.00287178760984}
    },

    '2y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за два года с 2022-12-31',
        gainers: {'COP': 24.899409651520095, 'PLN': 20.675799193463803, 'GBP': 17.380265777876485, 'ISK': 16.507143191338706, 'CHF': 15.6101408852357},
        losers: {'PKR': -7.847276578563865, 'RUB': -24.247249925515277, 'TRY': -40.2090876182835, 'EGP': -44.77604727478301, 'ARS': -80.54359856795881}
    },

    '3y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за три года с 2021-12-31',
        gainers: {'PEN': 30.999142231634142, 'CHF': 24.937891147066445, 'HKD': 24.517254322573702, 'SAR': 23.924952379997777, 'QAR': 23.90184867885893},
        losers: {'UAH': -19.496871112059257, 'PKR': -21.54288953626877, 'TRY': -53.43125138241649, 'EGP': -61.7475611957868, 'ARS': -87.64803223631347}
    },

    '5y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за пять лет с 2019-12-31',
        gainers: {'CHF': 41.4724726615476, 'HKD': 32.763262817634384, 'AED': 32.50976330658915, 'USD': 32.50615534069746, 'QAR': 32.50615534069729},
        losers: {'RUB': -25.6146436726885, 'PKR': -26.378621615650328, 'EGP': -58.21724475852984, 'TRY': -77.71216564193891, 'ARS': -92.30349832204816}
    },

    '10y': {
        title: 'Лидеры абсолютного роста/падения валют Forex за десять лет с 2014-12-31',
        gainers: {'CHF': 75.77644439439982, 'ILS': 71.91943065802867, 'QAR': 60.40699837129073, 'AED': 60.3584250598718, 'USD': 60.34532709164026},
        losers: {'PKR': -41.86466108173871, 'KZT': -44.27741597314791, 'EGP': -77.48755396810068, 'TRY': -89.42929745473978, 'ARS': -98.68281762421839}
    },

};

// Массив с названиями валют из cur_descr
const currencyNames = {
   'AED': 'Дирхам ОАЭ',
   'ARS': 'Аргентинское песо',
   'AUD': 'Австралийский доллар',
   'BRL': 'Бразильский реал',
   'CAD': 'Канадский доллар',
   'CHF': 'Швейцарский франк',
   'CLP': 'Чилийское песо',
   'CNY': 'Китайский юань',
   'COP': 'Колумбийское песо',
   'CZK': 'Чешская крона',
   'DKK': 'Датская крона',
   'EGP': 'Египетский фунт',
   'EUR': 'Евро',
   'GBP': 'Фунт стерлингов',
   'HKD': 'Гонконгский доллар',
   'HUF': 'Венгерский форинт',
   'IDR': 'Индонезийская рупия',
   'ILS': 'Новый израильский шекель',
   'INR': 'Индийская рупия',
   'ISK': 'Исландская крона',
   'JPY': 'Японская иена',
   'KRW': 'Южнокорейская вона',
   'KWD': 'Кувейтский динар',
   'KZT': 'Казахстанский тенге',
   'MXN': 'Мексиканское песо',
   'MYR': 'Малайзийский ринггит',
   'NOK': 'Норвежская крона',
   'NZD': 'Новозеландский доллар',
   'PEN': 'Перуанский новый соль',
   'PHP': 'Филиппинское песо',
   'PKR': 'Пакистанская рупия',
   'PLN': 'Польский злотый',
   'QAR': 'Катарский риал',
   'RON': 'Румынский лей',
   'RUB': 'Российский рубль',
   'SAR': 'Саудовский риял',
   'SEK': 'Шведская крона',
   'SGD': 'Сингапурский доллар',
   'THB': 'Тайский бат',
   'TRY': 'Турецкая лира',
   'TWD': 'Новый тайваньский доллар',
   'UAH': 'Украинская гривна',
   'USD': 'Доллар США',
   'VND': 'Вьетнамский донг',
   'ZAR': 'Южноафриканский рэнд',

};

// Функция для отображения данных в соответствующий div
function displayData(period) {
    const container = document.getElementById('text_data_' + period);
    
    if (!container) return;

    const { title, gainers, losers } = data[period];

    let htmlContent = `<h2>${title}</h2><h3>Наибольший рост</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(gainers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table><h3>Наибольшее падение</h3><table border='1' style='border-collapse: collapse; width: 100%; text-align: center;'><tr><th>Тикер</th><th>Имя валюты</th><th>Изменение (%)</th></tr>`;
    
    for (const [ticker, change] of Object.entries(losers)) {
        htmlContent += `<tr><td><a href="https://www.abscur.ru/p/2.html?abs=${ticker}">${ticker}</a></td><td>${currencyNames[ticker]}</td><td>${change.toFixed(2)}</td></tr>`;
    }

    htmlContent += `</table>`;
    
    container.innerHTML = htmlContent;
}

// Вызов функции для отображения данных при загрузке страницы
document.addEventListener('DOMContentLoaded', function() {
   displayData('1m');
   displayData('1q');
   displayData('y2');
   displayData('1y');
   displayData('2y');
   displayData('3y');
   displayData('5y');
   displayData('10y');

});
